; TaskSwitchXP Pro 2.05 English Language File (Template)
; Translated by Alexander Avdonin <alexander@ntwind.com>


; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="English"


; Cofiguration
20000="Konfiguracja TaskSwitchXP Pro 2.0"
20001="OK"
20002="Anuluj"
20003="Zastosuj"

; Filters
20031="Pliki konfiguracyjne TaskSwitchXP (*.cfg)"


; Pages
20050="Ogólne"
20051="Wygląd"
20052="Lista procesów"
20053="Podgląd"
20054="Informacje o procesach"
20055="Klawisze skrótów"
20056="Wykluczenia"
20057="Zaawansowane"
20058="O programie"

; Page descriptions
20070="Ustawienia ogólne"
20071="Ustawienia wyglądu"
20072="Lista procesów"
20073="Ustawienia podglądu"
20074="Informacje o procesach"
20075="Klawisze skrótów TaskSwitchXP"
20076="Wykluczenia TaskSwitchXP"
20077="Ustawienia zaawansowane"
20078="O programie TaskSwitchXP"


; General page
20100="Język:"
20101="<a id=\"idLang\" href=\"\">Znajdź więcej tłumaczeń...</a>"
20102="Użyj oddzielnych ustawień dla każdego użytkownika w systemie"
20103="Uruchamiaj TaskSwitchXP automatycznie podczas startu systemu"
20104="Nadaj programowi TaskSwitchXP wysoki priorytet"
20105="Sprawdź czy Ms PowerToy TaskSwitcher jest uruchomiony"
20106="Ikony zasobnika systemowego (tray):"
20107="Pokazuj ikonę TaskSwitchXP w zasobniku systemowym"
20108="Użyj własnej ikony:"
20109="Minimalizuj okna do zasobnika systemowego przez kliknięcie prawym przyciskiem na klawisz Minimalizuj"
20110="Nie ukrywaj ikony TaskSwitchXP (ukrywanie nieaktywnych ikon)"
20111="Dodaj okna zminimalizowane do zasobnika na koniec listy aplikacji"

20120="Ustawienia domyślne"
20121="Otwórz..."
20122="Zapisz..."

; Appearance page
20200="Pozycja na ekranie:"
20201="Pokaż na aktywnym monitorze"
20202="Cień pod oknem TaskSwitchXP"
20203="Przeźroczystość okna TaskSwitchXP:"
20204="Animacja przy otwieraniu okna (w millisekundach):"
20205="Animacja przy zamykaniu okna (w millisekundach):"
20206="Preferowane tryby rysowania:"
20207="Styl Windows XP:"
20208="Styl klasyczny:"
20209="Wymuś użycie stylu klasycznego TaskSwitchXP"
20210="Ustawienie paneli okna (lewo-prawo)"

; Position on screen
20270="Góra - Lewo"
20271="Góra - Środek"
20272="Góra - Prawo"
20273="Środek - Lewo"
20274="Wyśrodkowane"
20275="Środek - Prawo"
20276="Dół - Lewo"
20277="Dół - Środek"
20278="Dół - Prawo"

; Modern XP skins
20280="Styl menu Start (domyślny)"
20281="Styl PowerToy TaskSwitcher"
20282="Styl Simple Window"
20283="Styl Flat XP"
20284="Styl Soft XP"
20285="Styl TaskBar"

; Classical skins
20290="Styl menu Start (domyślny)"
20291="Styl Flat Start Panel"


; Task List page
20300="Wygląd listy:"
20301="Liczba kolumn:"
20302="Szerokość (w pikselach):"
20303="Liczba linii:"
20304="Małe ikony"
20305="Pokaż podpowiedzi na liście ikon"
20306="Włącz kursor ręki do wyboru pozycji z listy"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="Włącz wybieranie za pomocą myszy"
20308="Obróć kółko myszy"
20309="Styl podświetlenia wyboru:"
20310="Rozmazuj krawędzie"
20311="Styl tekstu i kolory:"
20312="Czcionka:"
20313="Rozmiar:"
20314="B"
20315="I"
20316="Kolory:"

; List views
20390="Ikony"
20391="Pionowa lista"

; Selection styles
20380="Ramka"
20381="Wypełniony prostokąt"
20382="Zaokrąglony prostokąt"

; Color indexes
20370="Zwykły tekst"
20371="Wybrany tekst"
20372="Tło wyboru"
20373="Zaznaczony tekst 1"
20374="Tło zaznaczenia 1"
20375="Zaznaczony tekst 2"
20376="Tło zaznaczenia 2"


; Preview page
20400="Styl podglądu:"
20401="Styl podglądu \"Pulpit\""
20402="Styl podglądu \"Okno\""
20403="Pokazuj pasek narzędzi Windows na obrazie podglądu"
20404="Pokazuj tylko ostatnie okno aplikacji"
20405="Nie pokazuj tła pulpitu w oknie podglądu (stary styl v1.0)"
20406="Pokazuj tapetę pulpitu jako tło"
20407="Rysuj obramowanie dookoła obrazu podglądu"
20408="Wyśrodkuj obraz podglądu w pionie"
20409="Pokaż opis okna zminimalizowanego w oknie podglądu (*)"
20410="Wykluczaj wszystkie nałożone okna z podglądu (*)"
20411="Szerokość obrazu podglądu (w pikselach):"
20412="Opóźnienie generowania pierwszego podglądu (w millisekundach):"
20413="Nie keszuj obrazów podglądu"
20414="Włącz aktualizacje podglądu w czasie rzeczywistym (w millisekundach):"


; Info page
20500="Część opisowa:"
20501="Czcionka:"
20502="Rozmiar:"
20503="B"
20504="I"
20505="Kolor:"
20506="Cień:"
20507="Głębokość:"
20508="Kolor:"
20509="Pokaż ikonę aplikacji w opisie"
20510="Użyj małych ikon w opisie"
20511="Część informacyjna:"
20512="Czcionka:"
20513="Rozmiar:"
20514="B"
20515="I"
20516="Kolor:"
20517="Cień:"
20518="Głębokość:"
20519="Kolor:"
20520="Wysokość:"
20521="Format:"

; Info formats
20590="Żaden"
20591="Tylko numer procesu"
20592="ID procesu"
20593="Nazwa procesu"
20594="Nazwa procesu [PID]"
20595="Opis programu"


; Hotkeys page
20600="Zastąp standardowy przełącznik pomiędzy aplikacjami (Alt-Tab)"
20601="Włącz przełączanie pomiędzy instancjami (Ctrl+Alt+[Shift]+Tab)"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Nie ukrywaj okna TaskSwitchXP po zwolnieniu klawisza Alt"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Użyj niskopoziomowej metody zastąpienia klawiszy Alt-Tab"
20604="Sterowanie TaskSwitchXP:"
20605="Lista aplikacji:"
20606="Lista instancji:"
20607="Konfiguracja TaskSwitchXP:"
20608="Pokaż/ukryj ikonę w zasobniku systemowym:"
20609="Zamknij TaskSwitchXP:"
20610="Dodatkowe klawisze skrótów:"
20611="Minimalizuj okno do zasobnika systemowego:"
20612="Przywróć okno z zasobnika systemowego:"


; Exclusions page
20700="Nowe..."
20701="Edycja..."
20702="Usuń"

; List groups
20780="Rysowanie podglądu"
20781="Zliczanie okien"

20790="Nazwa"
20791="Parametry"

; Advanced page
20800="Nazwy okien:"
20801="Użyj nazwy okna głownego aplikacji"
20802="Zaawansowane ustawienia interfejsu:"
20803="Usuń część opisową"
20804="Usuń część informacyjną"
20805="Ikona zasobnika systemowego:"
20806="Menu kontekstowe:"
20807="Konfiguracja:"
20808="Lista aplikacji:"
20809="Lista instancji:"
20810="Ustawienia konfiguratora:"
20811="Pokazuj okno konfiguracji zawsze na wierzchu"
20812="Zapamiętaj pozycję okna konfiguracji"
20813="Zapamiętaj ostatnią stronę konfiguracji"
20814="Uruchamiaj TaskSwitchXP podczas startu/zamknięcia"

; Tray icon actions
20890="Żaden"
20891="Lewy przycisk myszy"
20892="Lewy przycisk myszy (podwójny klik)"
20893="Środkowy przycisk myszy"
20894="Środkowy przycisk myszy (podwójny klik)"
20895="Prawy przycisk myszy"
20896="Prawy przycisk myszy (podwójny klik)"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Tłumaczenie: <a id=\"idTranslatorHome\" href=\"http://www.toszcze.org\">Toszcze</a>"


; Exclusions dialog
22000="Wykluczenia TaskSwitchXP"
22001="OK"
22002="Anuluj"
22003="Aktywne aplikacje:"
22004="Aktualizuj"
22005="Nazwa wykluczenia:"
22006="Wykluczaj przez:"
22007="Nazwę procesu:"
22008="Klasę okna:"
22009="Nazwę okna:"
22010="Wykluczaj z:"
22011="pokazywania podglądu"
22012="zliczania okien"
22013="Aktywne"

22090="" ; not excluded
22091=">> wykluczona z podglądu"
22092=">> wykluczona ze zliczania"

; Configurator Errors
30000="Błąd konfiguracji TaskSwitchXP"
30002="Nie mogę uruchomić TaskSwitchXP.exe! Sprawdź swoją instalację TaskSwitchXP."
30003="Nie mogę zapisać ustawień w rejestrze. Sprawdź swoje uprawnienia."
30004="Nie mogę załadować ustawień z pliku."
30005="Nie mogę załadować ustawień z pliku. Zostały przywrócone ustawienia domyślne."
30006="Nie mogę zapisać ustawień do pliku."

; Hints for exclusion dialog
30100="Brak nazwy wykluczenia"
30101="Proszę wpisać nazwę wykluczenia."
30102="Brak parametrów"
30103="Proszę podać parametr(y) wykluczenia."
30104="Brak nazwy procesu"
30105="Proszę podać nazwę procesu."
30106="Brak klasy okna"
30107="Proszę podać klasę okna."

; Confirmations
30900="Potwierdzenie TaskSwitchXP"
30901="TaskSwitchXP wykrył, że w Twoim systemie istnieje więcej niż jeden monitor.\r\nCzy chcesz uaktywnić tryb podglądu "Okno" aby móc podglądać aplikacje z wszystkich monitorów?"


; TaskSwitchXP Language Strings

; Tray menu
31000="Lista aplikacji"
31001="Lista instancji"	
31002="Ustawienia..."
31003="Wyjście"

31020="Szybkie ustawienia"
31021="Ukryj ikonę zasobnika"
31022="Zastąp Alt-Tab"
31023="Włącz przełączanie pomiędzy instancjami"
31024="Nie ukrywaj okna TaskSwitchXP po zwolnieniu klawisza Alt"
31025="Użyj niskopoziomowego zastąpienia klawiszy Alt-Tab"
31026="Nowe wyłączenie..."

31050="Pomoc"
31051="Dokumentacja"
31052="Strona domowa"
31053="O programie TaskSwitchXP"

; Tray menu for minimized applications
31090="TSXP: %d aplikacja(i)"
31091="Przywróć wszystkie"
31092="Minimalizuj wszystkie"
31093="Zamknij wszystkie"
31094="Przywróć"
31095="Minimalizuj"
31096="Zamknij"

; Task List menu
31110="Przełącz na"
31111="Minimalizuj"
31112="Minimalizuj do zasobnika"
31113="Kaskadowo"
31114="Sąsiadujące poziomo"
31115="Sąsiadujące pionowo"
31116="Przywróć"
31117="Maksymalizuj"
31118="Zamknij"
31119="Zakończ process"

; Common menu
31150="Pokaż informacje o procesie"
31151="Zaznacz wszystko"
31152="Nie zaznaczaj niczego"
31153="Usuń zaznaczone"
31154="Sortuj według nazwy"
31155="Sortuj według aplikacji"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Nazwa obrazu:  %s\r\nID procesu:  %u\r\n\r\nCzas trwania:  %u:%02u:%02u\r\nCzas procesora:  %u:%02u:%02u\r\n\r\nUżycie pamięci:  %uK\r\nRozmiar pamięci wirtualnej:  %uK"
31501="brak danych" ; Process information is not available...

; Confirmations
31900="Potwierdzenie TaskSwitchXP"
31901="TaskSwitchXP jest już uruchomiony. Czy chcesz go zatrzymać?"
31902="Czy na pewno chcesz wyłączyć TaskSwitchXP?"
31903="TaskSwitchXP wykrył, że program Ms PowerToy TaskSwitcher jest uruchomiony.\r\nCzy chcesz go wyłączyć?"

; Errors
32000="Błąd TaskSwitchXP"
32002="Inicjalizacja zakończyła się niepowodzeniem."
32003="Nie mogę zastosować niskopoziomowej metody zastąpienia Alt-Tab."
32004="Nie mogę zarejestrować klawiszy skrótu Alt+Tab lub Alt+Shift+Tab.\r\nByć może zostały one zarejestrowane przez inną aplikację."
32005="Nie mogę zarejestrować klawiszy skrótu Ctrl+Alt+Tab or Ctrl+Alt+Shift+Tab.\r\nByć może zostały one zarejestrowane przez inną aplikację."
32006="Nie mogę uruchomić ConfigTsXP.exe! Sprawdź swoją instalację TaskSwitchXP."

32500="Nie mogę zarejestrować klawisza skrótu:\r\n\r\nNazwa: %s\r\nModyfikatory: %02X\r\nVirtual Code: %02X"
32501="Zamknij TaskSwitchXP"
32502="Pokaż/ukryj ikonę w zasobniku"
32503="Konfiguruj TaskSwitchXP"
32504="Lista aplikacji"
32505="Lista instancji"
32506="Minimalizuj okno do zasobnika"
32507="Przywróć z zasobnika"
